import json

# bad = ["力", "讠", "覀", "凵", "屮", "对", "又", "着", "用", "行", "所", "然", "耂", "走", "还", "进", "好", "其", "止", "䒑", "民", "占", "正", "最", "攵", "巾", "西", "话", "合", "内", "言", "次", "申", "少", "务", "做", "艹", "即", "且", "记", "告", "歹", "步", "央", "字", "息", "谈", "尺", "吾", "势", "执", "节", "案", "维", "陈", "兴", "站", "严", "乛", "施", "绝", "祭", "双", "细", "愿", "网", "刻", "承", "谁", "送", "波", "省", "喜", "述", "习", "纳", "负", "州", "冲", "室", "策", "演", "判", "旡", "攸", "副", "份", "背", "阵", "草", "脚", "块", "顿", "弟", "货", "良", "域", "括", "斩", "圭", "毫", "席", "港", "输", "俞", "材", "垂", "尃", "孙", "爷", "篇", "稳", "杨", "妻", "替", "㚘", "休", "闪", "络", "纯", "郑", "狂", "赵", "蒋", "耶", "蓝", "献", "符", "触", "罚", "侠", "贯", "讯", "艾", "宿", "映", "启", "荒", "尝", "横", "码", "辡", "稍", "署", "奉", "骑", "亏", "凭", "绪", "卒", "荡", "溥", "酸", "挺", "艘", "叟", "峰", "趋", "汗", "彭", "骗", "慧", "孛", "撞", "滚", "贡", "朵", "柔", "籍", "牧", "佳", "豸", "扶", "询", "扣", "迁", "慰", "厌", "脏", "涌", "辖", "躲", "紫", "祝", "邮", "割", "誉", "凌", "粹", "抑", "踏", "沓", "慎", "搬", "削", "宏", "拨", "沃", "拼", "劫", "歇", "缴", "霸", "䩗", "搭", "耕", "酷", "翰", "屏", "姿", "糟", "葛", "鸿", "纲", "茨", "宛", "携", "吻", "奸", "柜", "悦", "诞", "卪", "杆", "僧", "甜", "摘", "矮", "吵", "屚", "潘", "拆", "辽", "棋", "唉", "纤", "玑", "夃", "谅", "陀", "屠", "渊", "痴", "喃", "尞", "芒", "甹", "厘", "愣", "饶", "叠", "瓷", "稣", "屁", "讽", "鼎", "肾", "谍", "沾", "咨", "芦", "沼", "株", "剖", "哗", "蹲", "嫩", "舀", "迄", "冀", "踩", "栗", "蜀", "泌", "逾", "叮", "拂", "蕴", "妆", "淑", "钞", "绞", "缅", "嗣", "熬", "桐", "泻", "诧", "嚼", "衙", "喧", "阑", "搂", "倏", "鳍", "邵", "弍", "贰", "虔", "嘟", "砰", "廖", "俭", "窦", "莺", "轼", "禀", "浊", "撼", "嗜", "熏", "忖", "牡", "提", "念", "医", "亘", "串", "签", "扑", "洁", "抚", "浅", "棚", "喀", "贱", "惕", "畔", "弯", "啇", "礻", "兀", "烦", "砍", "氢", "绒", "懈", "捣", "窥", "舶", "悼"]

with open('gloss_translation.json', 'r', encoding='utf-8') as f:
    gloss_translation = json.load(f)

for key in gloss_translation:
    if "gloss_review" in gloss_translation[key]:
        del gloss_translation[key]["gloss_review"]
    if "atlgloss_fr" in gloss_translation[key]:
        del gloss_translation[key]["atlgloss_fr"]
    if "reason_fr" in gloss_translation[key]:
        del gloss_translation[key]["reason_fr"]

with open('gloss_translation-final.json', 'w', encoding='utf-8') as f:
    json.dump(gloss_translation, f, ensure_ascii=False, indent=4)



# replaced = {}
# for key in bad_translations:
#     if key in bad:
#         replaced[key] = bad_translations[key]
#         replaced[key]["gloss_fr"] = replaced[key]["atlgloss_fr"]


# with open('gloss_translation-thinking-B-replaced.json', 'w', encoding='utf-8') as f:
#     json.dump(replaced, f, ensure_ascii=False, indent=4)












